In [1]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np

In [1]:
print("my name is fareena")

my name is fareena

In [2]:
dict1={"Names":['Ramesh','Suresh',np.nan,'Mahesh'],
      'Age':[31,32,33,np.nan],
      'City':[np.nan,"hyd",'Mumbai','Chennai']}

In [3]:
data1=pd.DataFrame(dict1)

In [4]:
data1

    Names   Age     City
0  Ramesh  31.0      NaN
1  Suresh  32.0      hyd
2     NaN  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [6]:
data1.isnull()

   Names    Age   City
0  False  False   True
1  False  False  False
2   True  False  False
3  False   True  False

In [7]:
data1.isnull().sum()

Names    1
Age      1
City     1
dtype: int64

In [8]:
data1.isnull().sum()*100/len(data1)

Names    25.0
Age      25.0
City     25.0
dtype: float64

In [10]:
dict2={"Names":['Ramesh','Suresh',None,'Mahesh'],
      'Age':[31,32,33,None],
      'City':[None,"hyd",'Mumbai','Chennai']}
data2=pd.DataFrame(dict2)
data2

    Names   Age     City
0  Ramesh  31.0     None
1  Suresh  32.0      hyd
2    None  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [11]:
data2.isnull()

   Names    Age   City
0  False  False   True
1  False  False  False
2   True  False  False
3  False   True  False

In [12]:
data2.isnull().sum()

Names    1
Age      1
City     1
dtype: int64

In [13]:
dict3={"Names":['Ramesh','Suresh','Null','Mahesh'],
      'Age':[31,32,33,'Null'],
      'City':['Null',"hyd",'Mumbai','Chennai']}

In [17]:
data3=pd.DataFrame(dict3)
data3

    Names   Age     City
0  Ramesh    31     Null
1  Suresh    32      hyd
2    Null    33   Mumbai
3  Mahesh  Null  Chennai

# Method-1

In [18]:
data1.fillna(40)

    Names   Age     City
0  Ramesh  31.0       40
1  Suresh  32.0      hyd
2      40  33.0   Mumbai
3  Mahesh  40.0  Chennai

# Method-2

In [22]:
data1['Names'].fillna('Sathish',inplace=True)
data1

     Names   Age     City
0   Ramesh  31.0      NaN
1   Suresh  32.0      hyd
2  Sathish  33.0   Mumbai
3   Mahesh   NaN  Chennai

In [23]:
dict1={"Names":['Ramesh','Suresh',np.nan,'Mahesh'],
      'Age':[31,32,33,np.nan],
      'City':[np.nan,"hyd",'Mumbai','Chennai']}
data1=pd.DataFrame(dict1)

# Method-3

In [24]:
data1.fillna(method='backfill')

    Names   Age     City
0  Ramesh  31.0      hyd
1  Suresh  32.0      hyd
2  Mahesh  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [26]:
data1.fillna(method='ffill')

    Names   Age     City
0  Ramesh  31.0      NaN
1  Suresh  32.0      hyd
2  Suresh  33.0   Mumbai
3  Mahesh  33.0  Chennai

In [27]:
data1.fillna(method='bfill')

    Names   Age     City
0  Ramesh  31.0      hyd
1  Suresh  32.0      hyd
2  Mahesh  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [28]:
data1.fillna(method='pad')

    Names   Age     City
0  Ramesh  31.0      NaN
1  Suresh  32.0      hyd
2  Suresh  33.0   Mumbai
3  Mahesh  33.0  Chennai

# Method-4

In [29]:
data1

    Names   Age     City
0  Ramesh  31.0      NaN
1  Suresh  32.0      hyd
2     NaN  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [30]:
age_mean=data1['Age'].mean()
age_mean

32.0

In [31]:
data1['Age'].fillna(age_mean)

0    31.0
1    32.0
2    33.0
3    32.0
Name: Age, dtype: float64

In [32]:
age_median=data1['Age'].median()
age_median

32.0

In [33]:
data1['Age'].fillna(age_median)

0    31.0
1    32.0
2    33.0
3    32.0
Name: Age, dtype: float64

In [34]:
age_mode=data1['Age'].mode()
age_mode

0    31.0
1    32.0
2    33.0
Name: Age, dtype: float64

In [35]:
data1['Age'].fillna(age_mode)

0    31.0
1    32.0
2    33.0
3     NaN
Name: Age, dtype: float64

# KNN imputer

In [40]:
from sklearn.impute import KNNImputer
knn=KNNImputer(n_neighbors=2)
knn.fit_transform(data1[['Age']])

array([[31.],
       [32.],
       [33.],
       [32.]])

In [41]:
data1

    Names   Age     City
0  Ramesh  31.0      NaN
1  Suresh  32.0      hyd
2     NaN  33.0   Mumbai
3  Mahesh   NaN  Chennai